citys = {
    "北京": {
        "东城": {
            "东华门街道": {
                "天安门广场": [
                    "天安门广场，位于北京市中心，地处东城区东长安街，北起天安门，南至正阳门，东起中国国家博物馆，西至人民大会堂，南北长880米，东西宽500米，面积达44万平方米，可容纳100万人举行盛大集会，曾被评为“北京十六景”之一"],
                "故宫": ["北京故宫是中国明清两代的皇家宫殿，旧称紫禁城，位于北京中轴线的中心。北京故宫以三大殿为中心，占地面积72万平方米，建筑面积约15万平方米，有大小宫殿七十多座，房屋九千余间"],
                "王府井": ["王府井是一条具有数百年悠久历史的商业街，在北京享有“金街”美誉"]
            },
            "景山街道": {
                "隆福寺": [
                    "隆福寺位于东四十字路口的西北角。始建于明代景泰三年，清朝雍正九年重修。占地20000平方米，隆福寺在明代是京城唯一的番、禅同驻的寺院，清代成为完全的喇嘛庙。隆福寺坐落在东四北大街西，始建于明代景泰三年（1452年），清雍正九年重修。"],
                "黄化门": ["黄化门街全长409米，宽12米，沥青路面。 黄化门街，清朝属皇城，光绪时称东黄瓦门，据《日下旧闻考》载：黄瓦门之名见于佛寺碑刻。"]
            },
            "交道口街道": {
                "南锣鼓巷": ["南锣鼓巷是一条胡同，位于北京中轴线东侧的交道口地区，北起鼓楼东大街，南至平安大街，宽8米，全长787米，是北京最古老的街区之一，已有740多年的历史，是最赋有老北京风情的街巷。"],
                "文天祥祠": ["北京文天祥祠：又名文丞相祠，坐落在东城区府学胡同63号，是南宋民族英雄文天祥当年遭囚禁和就义的地方。"]
            },
            "安定门街道": {
                "国子监大街": ["国子监街，位于东城区西北部。东起雍和宫大街，西至安定门内大街。清代名“成贤街”，因孔庙和国子监在此而得名，又称国子监胡同。"],
                "孔庙": ["曲阜孔庙（又名：阙里至圣庙）位于山东省济宁市曲阜市中心，是祭祀中国古代著名思想家和教育家孔子的祠庙。"],
                "钟楼": ["北京钟鼓楼，分为钟楼与鼓楼两部分组成，是古代城市标志性建筑。鼓楼在南，钟楼在北，占地约13000平方米。"],
                "鼓楼": ["天津卫三宗宝，鼓楼、炮台、铃铛阁。明朝永乐二年（公元一四零四天津鼓楼旧照年），天津设卫筑城，当时，这座卫城只不过是土围子。"],

            },
            "北新桥街道": {
                "梁启超故居": ["梁启超故居北沟沿胡同属东城区北新桥地区，在东直门南小街迤西。胡同自北向南沟通大菊胡同和东四十四条，长300多米。"],
                "通教寺": ["柏林寺，始建于汉献帝建安年间，位于石家庄市赵县县城东南角，内设河北省佛学院、河北禅学研究所，现任方丈为明海禅师，常住僧众有160余人"],
                "北新仓": ["北新仓在东城区北新仓胡同甲16号。为明、清两代粮仓。 元代时，东直门一带曾为河道，明中期，仍可漕运，在此先后设立海运仓、北新仓储存漕粮。"],
                "雍和宫": ["雍和宫位于北京市东城区，最早为清世宗胤禛作贝勒和亲王时期的府邸、清高宗弘历降生和成长之地，是雍、乾两代帝王的“在潜之居”。"],
            },
            "东四街道": {
                "亲，这边没有景点，请输入任意数字重新选择"
            },
        },
        "西城": {
            "西长安街街道": {
                "中南海": ["中南海是中海和南海的合称，位于北京故宫西侧，鳌玉桥以南，面积约1500亩，其中水面700亩，是全国重点文物保护单位。其前身为西苑，在解放前一直是历朝封建帝王的行宫和宴游的地方"],
                "天主教南堂": ["宣武门天主堂又称南堂，位于北京市宣武门前门西大街141号，是一座历史悠久的天主堂。"],
                "礼亲王府": ["礼亲王府位于西城区西皇城根南街西侧，即大酱坊胡同东口路北。南起大酱房胡同，北至颁赏胡同，占地约30公顷。"],
                "福佑寺": ["福佑寺始建于清 顺治年间（1644-1661年），俗称雨神庙，位于 紫禁城 西华门外 北长街北口路东，为北京市 文物保护单位。"],
                "国家大剧院": [
                    "中国国家大剧院（National Centre for the Performing Arts of China）是新“北京十六景”之一的地标性建筑，也是国家兴建的重要文化设施，位于人民大会堂西侧，由主体建筑及南北两侧的水下长廊、地下停车场、人工湖、绿地组成。"]

            },
            "新街口街道": {
                "亲，这边没有景点，请输入任意数字重新选择"
            },
            "月坛街道": {
                "月坛": ["位于北京西城区阜成门外的月坛，又名夕月坛，建于明嘉靖九年，是北京著名的五坛八庙之一，是明清两代帝王祭祀月神和天上诸星神的地方。"],
                "明北京城墙遗址": ["明北京城墙遗址位于西二环路南端，建于明正统四年。 建筑年代：西便门明北京城墙遗址，位于西二环路南端，建于明正统四年。"],
                "清真永寿寺": ["清真永寿寺，明万历三十三年始建，天启四年重修。重修碑为进士石三畏撰文。寺门一间，石门额上书“清真礼拜永寿寺”。入大门后左为水房名“规洁室”。右为望月楼，二层，上有横匾曰“唤醒楼”。"],
                "白云观": ["始建于隋朝,它比全真龙门派祖师丘处机修建北京白云观的时间要早六百余年，传说是当时全国第三处白云观，有三大殿、六配殿组合而成，前设钟鼓二楼。"]
            },
        },

    }
}
shop = [
    ["盛锡福的羊皮前进帽", 260],
    ["瑞蚨祥的长袍马褂", 1000],
    ["内联升的布鞋", 700],
    ["同仁堂的滋补品 人参", 10000],
    ["老北京花茶", 200],
    [".福禄寿漆盘中国结", 458],
    ["兔爷儿", 85],
    ["毛猴", 120],
    ["四合院拼图", 40],
    ["福娃球形拼图 ", 290],
    ["北京风格布老虎鞋", 48],
    ["兴穆水管灯", 120],
    ["老北京剪纸", 100],
    ["老北京泥人彩塑", 100],
    ["老北京建筑模型系列", 220],
    ["“拆”系列摄影明信片", 51],
    ["老北京图案扑克及明信片", 85],
    [" 创可贴北京元素T恤", 98],
    [" 京绣真丝围巾", 598],
    ["邢兰香的料器", 200]
]
import random
from typing import List, Union

mycart: List[Union[List[Union[str, float]], List[Union[str, int]]]] = []  # 空的购物车
# 初始化余额
salary = float(input("请输入您的钱包余额："))
salary: float
sal = salary = float(salary)


def showCity(citys):
    print("---------欢迎来到海强北京通旅游导航系统！-------------")
    for i in citys:
        print(i)
    print("---------------------------------------")


#
while True:
    showCity(citys)
    chose = input("请输入您想去的一级城市：")
    if chose == 'q' or chose == 'Q':
        print("--------------欢迎下次光临,拜拜嘞你嘞！-------------------")
        break  # 跳出循环
    if chose not in citys:
        print("温馨提示：当前城市没有项目！别瞎弄！")
    else:
        showCity(citys[chose])
        chose2 = input("请输入您想去的二级城市：")
        if chose2 == 'q' or chose2 == 'Q':
            print("--------------欢迎下次光临,拜拜嘞你嘞！-------------------")
            break  # 跳出循环
        if chose2 not in citys[chose]:
            print("都跟你讲了没有这个城市项目，别瞎弄！")
        else:
            showCity(citys[chose][chose2])
            chose3 = input("请输入您想去的三级城市：")
            if chose3 == 'q' or chose3 == 'Q':
                print("--------------欢迎下次光临,拜拜嘞你嘞！-------------------")
                break  # 跳出循环
            if chose3 not in citys[chose][chose2]:
                print("你故意找茬是不是？别瞎弄！")
            else:
                showCity(citys[chose][chose2][chose3])
                chose4 = input("请输入你想去的地方：")
                if chose4 == 'q' or chose4 == 'Q':
                    print("--------------欢迎下次光临,拜拜嘞你嘞！-------------------")
                    break  # 跳出循
                if chose4 not in citys[chose][chose2][chose3]:
                    print("你故意找茬是不是？别瞎弄！")
                else:
                    showCity(citys[chose][chose2][chose3][chose4])
                    print("车已经达到！祝你玩的愉快！")
                    coupo1 = random.randint(0, 10)  # 福禄寿漆盘中国结的优惠卷
                    print("您有%d张福禄寿漆盘中国结优惠卷三折" % coupo1)
                    a = 0.3
                    Threefold = float(a)
                    coupo2 = random.randint(0, 20)  # 福娃球形拼图优惠卷
                    print("您有%d张福娃球形拼图优惠卷九折" % coupo2)
                    b = 0.9
                    ninefold = float(b)
                    jinianping = input("请问您是否去购买纪念品，yes或者no：")
                    if jinianping == 'yes' and 'YES':
                        while True:
                            for key, value in enumerate(shop):
                                print(key, value)
                            chose = input("请输入您要买的商品编号：")  # "9aa" --> 9
                            if chose.isdigit():
                                chose = int(chose)
                                if chose >= len(shop):
                                    print("温馨提示：当前没有该商品！别瞎弄！")
                                else:
                                    if salary < shop[chose][1]:
                                        print("温馨提示：穷鬼，没钱，别瞎买！")

                                    else:
                                        if chose == 5 and coupo1 > 0:
                                            print("是否使用优惠卷", end=",")
                                            youhuijuan1 = input('请输入y或n：')
                                            youhuijuan1: str
                                            if youhuijuan1 == "y":
                                                print("成功使用一张老福禄寿漆盘中国结优惠卷")
                                                coupo1 -= 1
                                                salary -= (shop[chose][1] * 0.3)
                                                mycart.append(shop[chose])
                                                print(shop[chose][0], "添加购物车成功！余额还剩:￥", salary)
                                                print("还剩%d张福禄寿漆盘中国结优惠卷" % coupo1)
                                            else:
                                                if youhuijuan1 == "n":
                                                    salary = salary - shop[chose][1]
                                                    mycart.append(shop[chose])
                                                    print(shop[chose][0], "添加购物车成功！余额还剩:￥", salary)
                                                    print("还剩%d张福禄寿漆盘中国结优惠卷" % coupo1)
                                        elif chose == 9 and coupo2 > 0:
                                            print("是否使用优惠卷", end=",")
                                            youhuijuan2 = input('请输入y或n：')
                                            youhuijuan2: str
                                            if youhuijuan2 == "y":
                                                print("成功使用一张福娃球形拼图拼图优惠卷")
                                                coupo2 -= 1
                                                salary -= (shop[chose][1] * 0.9)
                                                mycart.append(shop[chose])
                                                print(shop[chose][0], "添加购物车成功！余额还剩:￥", salary)
                                                print("还剩%d张福娃球形拼图优惠卷" % coupo2)
                                            else:
                                                if youhuijuan2 == "n":
                                                    salary = salary - shop[chose][1]
                                                    mycart.append(shop[chose])
                                                    print(shop[chose][0], "添加购物车成功！余额还剩:￥", salary)
                                                    print("还剩%d福娃球形拼图张优惠卷" % coupo2)
                                        else:
                                            salary = salary - shop[chose][1]
                                            mycart.append(shop[chose])  # 购物车
                                            print(shop[chose][0], "添加购物车成功！余额还剩:￥", salary)
                            elif chose == "q" or chose == "Q":
                                print("欢迎下次光临！")
                                break

                            else:
                                print("兄弟，商品不存在！别瞎弄！")
                        print("----------------欢迎下次光临海强北京纪念品商店--------------")
                        print("以下是您的购物小条，请拿好：")
                        print("--------------------------------------------------")
                        m = []
                        for i in mycart:
                            if i not in m:
                                m.append(i)
                                print(" %s x %s " % (i, mycart.count(i)))
                            else:
                                continue
                        k = (sal - salary)
                        o = round(k, 2)
                        er = salary
                        re = round(er, 2)
                        print("-------------------------------------------------")
                        print("您本次还剩余额为：￥", re, "，本次消费：￥", o)


                    else:
                        print("祝你玩的愉快！")
